{
    "title": "M320",
    "mainTitle": "M320 => Objektorientiert Programmieren",
    "cards": [
        { "title": "Thems", "value": 5 },
        { "title": "Sections", "value": 11 },
        { "title": "Codes", "value": 20 }
    ],
    "charts": [
        {
            "type": "verzeichnis",
            "title": "Verzeichnis",
            "items": [
                { "label": "1. Einleitung", "id": "section1" },
                { "label": "2. Grundlagen", "id": "section2" },
                { "label": "3. Module01", "id": "section3" },
                { "label": "4. Module02", "id": "section4" },
                { "label": "5. Module03", "id": "section5" },
                { "label": "6. Module04", "id": "section6" },
                { "label": "7. Module05", "id": "section7" },
                { "label": "8. Module06", "id": "section8" },
                { "label": "9. Module07", "id": "section9" },
                { "label": "10. Module08", "id": "section10" },
                { "label": "11. Module09", "id": "section11" },
                { "label": "12. Module10", "id": "section12" },
                { "label": "13. Module11", "id": "section13" },
                { "label": "14. Ende", "id": "section14" }
            ]
        }
    ],
    "mainTextContent": [
        {
            "type": "text",
            "content": "Einleitung",
            "id": "section1",
            "subContent": [
                {
                    "type": "sub-container",
                    "content": "This is a sub-text element inside sub-layout."
                },
                {
                    "type": "image",
                    "src": "/html/modulen/gettyimages-1146649674-1024x1024.webp",
                    "alt": "Descriptive Alt Text",
                    "id": "section6"
                }
                 
            ]
        },
        {
            "type": "text",
            "content": "Grundlagen",
            "id": "section2",
            "subContent": [
                {
                    "type": "sub-text",
                    "content": "eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus ."
                },
                {
                    "type": "sub-text",
                    "content": "eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus vvvveue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus ."
                },
                {
                    "type": "sub-container-code",
                    "content": [
                        "int nums02[] = {1, 2, 3, 4, 3, 5};",
                        "int size02 = nums02.length;",
                        "int temp02 = 0;",
                        "",
                        "System.out.println(\"before sorting\");",
                        "for(int num02 : nums02) {",
                        "    System.out.print(num02 + \" \");",
                        "}",
                        "",
                        "for (int a02 = 0; a02 < size02 - 1; a02++) {",
                        "    boolean swapped = false;",
                        "",
                        "    for (int b02 = 0; b02 < size02 - 1 - a02; b02++) {",
                        "        if (nums02[b02] > nums02[b02 + 1]) {",
                        "            // Swap",
                        "            temp02 = nums02[b02];",
                        "            nums02[b02] = nums02[b02 + 1];",
                        "            nums02[b02 + 1] = temp02;",
                        "            swapped = true; // Set flag to true indicating a swap occurred",
                        "        }",
                        "    }",
                        "",
                        "    // If no elements were swapped, array is sorted",
                        "    if (!swapped) break;",
                        "}",
                        "",
                        "",
                        "",
                        "",
                        "",
                        
                        "",
                        "System.out.println();",
                        "System.out.println(\"after sorting\");",
                        "for(int num02 : nums02) {",
                        "    System.out.print(num02 + \" \");",
                        "}"
                    ]
                },
                {
                    "type": "sub-text",
                    "content": "eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus eue Klasse als eine Art der ursprünglichen Klasse verwendet werden kann. Diese Kombination aus ."
                    
                }
            ]
            
        },
        {
            "type": "sub-layout",
            "id": "section3",
            "subContent": [
                {
                    "type": "sub-text",
                    "content": "Vertiefung."
                },
                {
                    "type": "sub-text",
                    "content": "Vertiefung."
                }
            ]
        },
        {
            "type": "text",
            "content": "Beispiele.",
            "id": "section4"
        },
        {
            "type": "sub-layout",
            "id": "section5",
            "subContent": [
                {
                    "type": "sub-text",
                    "content": "This is a sub-text element inside sub-layout."
                },
                {
                    "type": "sub-text",
                    "content": "This is a sub-text element inside sub-layout."
                }
            ]
        }
    ]
}
